; This is the English language file for Open File shell for TC application, version 1.7?
; Information for translators.

; New lines (v1.7b -> v1.7c) are marked with the "; new" comments (above these lines),
; changed lines are marked with the "; changed" comment.
; Also, part of new strings is marked with the "; new (*)" symbols. While OpenFileTC
; wa in test, some translators have maked a temporary .lng-files. This mark show them
; all new strings. If you didn't make temp. translations, then do not make an attention on 
; this symbol - translate this string as new

; It's recommended to save this language file in Unicode. But if ANSI code works correctly
; in your country, then you can save language file in this code page.
;
; You can use "/s;" string (3 symbols, without quotes) to make a break in string.

; --------------------------------------------- ;
;						;
; Version 1.7c					;
;   valoare foarte importantă:                       ;
;   [Misc]                                      ;
;   4=,	                                        ;
;						;
;   !!! Nu schimbaţi aceasta valoare manual !!!	;
;   !!!        numai via OpenFileTC         !!! 	;
;						;
;   Schimbaţi virgula cu simbolul dvs. numai dacă   ;
;   virgula nu funcţionează în fişierul limbaj.        ;
;   La schimbarea limbajului de către3 utilizator, OFTC        ;
;   va schimba separatorul dintre extensii    ;
;   (în fişierul OpenFileTC.ini) cu acest simbol ;
;						;
;   Dacă cu virgulă funcţionează corect, nu ultilizaţi 	;
;   alt simbol				;
;						;
; --------------------------------------------- ;

[Misc]           ; info about author of this language file. Please fill all fields correctly and only about YOU :)

0=Romanian
;
1=Eugen ANTAL, Oradea, România
 ; versiune OpenFileTC suportată
2=1.7c
;
3=(C) Copyright, 2004-2007. Toate drepturile rezervate. E-Mail: eugensyl@yahoo.com

[MainUnit]       ; strings and messages for main window
0=EDITARE fişier %FileName% cu...
1=Aplicaţii:
2=Aplicaţii favorite:
3=Taste rapide
4=Programe eliminate
5=Altă aplicaţie...
6=Alegere program:
7=ATENŢIE! Fişierul selectat nu este executabil!/s;Aţi selectat fişierul: "%ProgramName%"./s;Extensia nu este EXE./s;Chiar vrei să utilizezi acest fişier?
8=Program:
9=Extensii:
10=Calea completă:
;
11=Programul specificat nu este găsit!
12=Editare asociere extensii
13=Schimb calea spre program
14=Redenumire
15=Taste rapide:
16=Elimin din listă
17=Redenumesc descrierea
18=Nume nou:
19=Doreşti într-adevăr să elimini programul "%ProgramName%"/s;din lista programelor disponibile?
;
20=ATENŢIE! Pe acest computer este instalat Total Commander./s;Se poate seta utilitarul "OpenFileTC" ca editor implicit pentru Total Commander./s;%NowStandProgram%/s;Avantaje:/s;- orice fişier apelat prin F4 va apela TOTDEAUNA programul de editare ADECVAT;/s;- setarea asociaţilor pentru extensii este simplă;/s;- programul este civilizat, adică nu este obraznic./s;/s;Dacă eşti interesat de unul din aceste avantaje APASĂ F4 din TC./s;Toate celelalte setări le va face programul pentru tine. /s;Fii liniştit, această fereastră nu mai apare nicidată, orice buton apeşi.
;
21=Mulţumesc pentru alegere!/s;/s;Dacă ACUM ai deschise mai multe sesiuni Total Commander,/s;este necesar să le reporneşti. Schimbările vor avea efect numai la următoarea lansare.
;
22=Atenţie! Pe acest computer este instalat DbCD Universal./s;Se poate seta programul "OpenFileTC" ca vizualizator pentru DbCD Universal./s;%NowStandProgram%/s;Avantaje:/s;- toate fişierele deschise spre vizualizare cu F3 vor apela TOTDEAUNA programul CORECT/s;- setarea asocierilor este simplă/s;- programul este civilizat, adică nu este obraznic/s;/s;Dacă eşti interesat de aceste avantaje APASĂ F4./s;Toate celelalte setări le va face programul pentru tine. /s;Fii liniştit, această fereastră nu mai apare nicidată, orice buton apeşi.
;
23=Mulţumesc pentru alegerea ta!/s;/s;Dacă ai deschise mai multe sesiuni DbCD Universal,/s;este necesar să le reporneşti. Schimbările vor avea efect la următoarea lansare.
;
24=Selectaţi un program care recunoaşte /s;si editează fişierul %FileName%
25=Deschide totdeauna acest tip de fişiere[extensia de mai sus], cu aplicaţia selectată!
26=Setare %ProgramName%
27=Deschide, dar nu investiga după aplicaţie
28=Deschide cu %ProgramName%
29=Nr. accesări:
;
30=Acum rulezi programul fără parametri. Nu este recomandat să adaugi programe în acest mod de lucru. În aceste condiţii, mai doreşti să adaugi elemente noi în listă?
31=Nu mai arăta niciodată fereastra de selectare pentru fişiere de tipul %FileType%./s;Deschide fişierul cu aplicaţia selectată chiar acum.
32=OK
33=Setare program 'OpenFileTC'
34=Anulare
35=Sortare după...
36=General
37=Arată iconiţe
38=Configurare condiţii
39=Acum se foloseşte programul: "%ProgramName%"
40=Lista tuturor aplicaţiilor
;
41=Editare executabile/s;/s;OpenFileTC a identificat un fişier executabil:/s;%FileName%/s;Doriţi să adăugaţi acest fişier în lista editoarelor OpenFileTC?/s;/s;Apăsaţi pe DA/YES dacă doriţi să adăugaţi acest editor la lista de editoare/s;Apăsaţi NU/NO pentru a edita acest fişier
;
42=Aplicaţia va fi afişată într-o fereastră
43=Eroare la crearea grupurilor de elemente program. Pot fi erori în program.
44=Nu pot crea setările "%INIFileName%"./s;Poate rulezi programul de pe un dispozitiv protejat la scriere sau fişierul este protejat la scriere./s;Programul va salva toate setările în directorul "%WinFolder%"
45=A apărut o eroare la crearea fişerului de setări./s;Numele fişierului: "%INIFileName%"./s;Mesaj Sistem: "%SystemMessage%"./s;Clasa de eroare: "%ClassMessage%"./s;/s;Programul s-a auto-suspendat.
46=Aplicaţia deschide numai primul/s;fişier din listă, fără ghilimele
47=Aplicaţia deschide numai primul/s;fişier din listă, cu ghilimele
48=Fiecare fişier va fi deschis printr-o /s;instanţă individuală a aplicaţiei, fără ghilimele
49=Fiecare fişier va fi deschis printr-o /s;instanţă individuală a aplicaţiei, CU ghilimele
 ; new (*)
50=Aplicaţia va fi minimizată pe bara de programe
; changed: "which know" -> "which knows" - mistake in English
51=Adaugă un program care recunoaşte /s;fişierele în formatul selectat
 ; new (*)
52=Aplicaţia va fi maximizată

[EditExtsUnit]   ; here strings and messages for extensions tuner window
0=Editare extensii pentru aplicaţia "%ProgramName%"
1=Ok
2=Renunţ
3=Adaug
4=Editez
5=Elimin
6=Extensie nouă
7=Extensia:
8=Deschide cu programul %ProgramName% chiar acum
9=Activare fereastra de selectare a programelor
10=Activitate
11=Tip
12=Linia de comanda
13=Variabile permise:/s;/s;%FullFileName% - numele complet al fişierului/s;%FileName% - numai numele (fără cale, fără extensie)/s;%FileExt% - extensia fişierului (fără punct)/s;Variabilele sunt sensibile la caractere (min/MAJ)

[SetupUnit]    ; setup window
0=Setare program 'OpenFileTC'
1=Limbaj:
2=Culori şi fonturi:
3=Elemente:
4=Selectare limbaj din lista limbajelor disponibile./s;Alte fişiere limbaj se pot descărca de pe Internet.
5=Secţiuni
6=Iconiţe mari
7=Listă
8=Iconiţe mici
9=Raport
10=Încarcă iconiţele originale ale aplicaţiilor
11=Afişează iconiţele originale din programe. /s;Altfel, vor fi afişate iconiţe implicite ale S.O.
12=Aplic
13=Aplic toate modificările
14=Ok
15=Salvez modificările şi închid caseta de dialog
16=Renunţ
17=Închid caseta de dialog, fără să aplic modificările
18=Fiecare utilizator va avea propriile setări
19=Utilizaţi această opţiune pentru a păstra opţiuni separate Open File TC /s;pentru fiecare utilizator al acestui computer
20=Dacă acest fişier există atunci fiecare utilizator al acestui computer va avea propriile setări. Dacă doriţi ca aceleaşi setări să fie valabile pentru toţi utilizatorii ştergeţi acest fişier. Acest comentariu poate fi şters.
21=Font...
22=Tip, mărime, culori pentru etichetele din fereastra principală
23=Fundal
24=Fundal fereastra principală
25=Cache Iconiţe
26=Încarcă iconiţele din executabile numai prima dată/s; apoi le va salva în subdirector (recomandat)
27=General
28=Opţiuni
29=Despre...
30=Selectare mod vizualizare iconiţe
31=Nu aştept după executabile
32=Nu va aştepta ca aplicaţia să încheie activitatea /s;cu fişierele deschise atunci când rulează
33=Arată bula info lângă mouse
34=Implicit, info-bula pentru executabile/s;va fi afişată în colţul ferestrei Open File TC
35=Arată info-bula
36=Arată info-bula aplicaţiei când/s;se mişcă mouse-ul deasupra, în fereastra principală
37=Fereastra program:
38=Dialog:
39=Tip, culori şi mărime pentru textul din alte ferestre
40=Tip de sortare a elementelor în fereastra principală:
41=Alege tipul de sortare pentru/s;aplicaţiile selectate din fereatra principală
42=Alfabetic
43=După nr. de accesări
;
44="Fiecare utilizator va avea propriile setări" - opţiunea va fi activată după repornirea aplicaţiei
45=Variante pentru forţarea apelării aplicaţiei
46=Tasta pt. comutare în aşteptare:
;
47=Dacă această tastă este activată,/s;OpenFileTC va deschide fiecare fişier
48=Staţionarea cursorului mouse-lui:
;
49=Dacă cursorul mouse-lui va fi plasat în colţul selectat,/s;OpenFileTC va deschide fiecare fişier
50=Selectaţi poziţia mouse-lui din listă
51=Selectaţi comutatorul din listă
52=Colţul Stânga-Sus al ecranului
53=Colţul Dreapta-Sus al ecranului
54=Colţul Stânga-Jos al ecranului
55=Colţul Dreapta-Jos al ecranului
56=Suport pentru deschiderea directoarelor
57=Permite deschiderea directoarelor selectate folosind tasta F4./s; Activează indicatorul %Dir% ca extensie agreeată./s;Citiţi mai multe în fişierul ajutor ( .chm)
 ; new
58=Status casetă de selecţie: "Totdeauna utilizez aplicaţia selectată..."
 ; new
59=Aici se poate seta prin caseta /s;de selecţie comportarea OFTC la pornire. Puteţi/s; lăsa acest comutatorul activat permanent/s;dezactivat permanent sau memora ultima stare/s;
; new
60=Memorarea ultimei stări selectate de utilizator
 ; new
61=Totdeauna dezactivat
 ; new
62=Totdeauna activat
 ; new (*)
63=Adăugare executabil în lista cu editoare active la apăsarea tastei F4 (în TC)
 ; new (*)
64=Dacă utilizatorii încep editarea fişierelor EXE,/s;atunci OpenFileTC va cere confirmarea utilizatorului la adaugarea/s;acestui EXE în lista editoarelor utilizate
 ; new (**)
65=Pagina Web:

[HotKeyUnit]    ; hot keys window
0=Combinaţii de taste
1=Setaţi combinaţiile de taste pentru rularea aplicaţiei %ProgramName%
2=Combinaţia curentă:
3=Combinaţie nouă:
4=Ok
5=Salvează modificările şi închide această fereastră
6=Renunţare
7=Închide această fereastră, fără salvare
8=Nu
9=Această combinaţie este rezervată de Open File TC şi nu poate fi folosită
10=Această combinaţie este deja folosită de aplicaţia %ProgramName%./s;Vreţi să setaţi această combinaţie pentru %CurrProgramName% şi să o ştergeţi de la anterioara?

[ProgramSettingsUnit]    ; new section for version 1.5, all strings are new
0=Proprietăţi %ProgramName%
1=Nume:
2=Calea aplicaţiei:
3=Linia de comandă pentru toate extensiile:
;
4=OpenFileTC nu găseşte fişierul specificat exe(cutiv)/s;Vă rog să validaţi calea introdusă
5=Vă rog denumiţi aici aplicaţia
6=Calea completă la fişierul executabil
7=Răsfoire
8=Soluţionare probleme cu deschiderea fişierelor
9=Nici o problemă
10=Nu este nici o problemă cu deschiderea/s;câtorva fişiere în această aplicaţie
11=Trimite spre aplicaţie numai primul fişier din întreaga listă, FĂRĂ ghilimele
12=Trimite spre linia de comandă numai primul fişier, /s;din întreaga listă, st, FĂRĂ ghilimele
13=Trimite spre aplicaţie numai primul fişier din întreaga listă, CU ghilimele
14=Trimite spre linia de comandă numai primul fişier, /s;din întreaga listă, st, CU ghilimele
15=Rulează o nouă instanţă a aplicaţiei pentru fiecare fişier, transferă numele fişierului CU ghilimele
16=Rulează câteva copii ale acestei aplicaţii,/s;iar fiecare copie va prelua următorul fişier din listă, ca parametru în linia de comandă./s;ATENŢIE: în acest caz Open File TC va opri urmărirea. /s; CU ghilimele
17=Extensii...
18=Setare listă de extensii pentru această aplicaţie
19=Ok
20=Salvează modificările şi închide fereastra
21=Renunţare
22=Închide fereastra fără salvarea modificărilor
23=Rulează o nouă instanţă a aplicaţiei pentru fiecare fişier, cu transferul numelui FĂRĂ ghilimele
24=Rulează câteva copii ale acestei aplicaţii,/s;iar fiecare copie va prelua următorul fişier din listă, ca parametru în linia de comandă./s;ATENŢIE: în acest caz Open File TC va opri urmărirea. /s; FĂRĂ ghilimele
25=Click pe imagine pentru selectarea/s;unui alt fişier resursă
; new:	applications' setup window, Open File dialog, caption
26=Selectare fişier cu pictograme
27=Salvare fişier în...
;new
28=Combinaţii de taste...
; new
29=Stabiliţi combinaţia de taste/s;ce va lansa o aplicaţie în fereastra OpenFileTC
; new
30=Combinaţie cu linia de comandă
; new
31=Puneţi aici o comandă pentru toate extensiile folosite de această aplicaţie
 ; new (*)
32=Schimbă iconiţa
 ; new (*)
33=Salvează iconiţa în fişierul...
 ; new (*)
34=Blocare fereastră la deschidere (funcţionarea acestei opţiuni nu este garantată):
 ; new (*)
35=Implicit
 ; new (*)
36=Intr-o fereastră
 ; new (*)
37=Minimizat
 ; new (*)
38=Maximizat
 ; new (**)
39=Deschide direct toate noile extensii cu acest editor
 ; new (**)
40=Dacă OpenFileTC nu va găsi niciun editor/s;pentru fişierele cu o anumită extensie, atunci acest fişier/s;va fi deschis direct cu acest editor

[FoundClipUnit]    ; all strings are new
0=în Clipboard 
1=IDentificator informaţie din clipboard: %BufferID%
2=Tip predeterminat:
3=Atenţie: aveţi o informaţie nerecunoscută în clipboard. Vă rog, încercaţi să identificaţi tipul informaţiei din clipboard. Folisiţi lista popup de deasupra pentru identificarea tipului.
4=Recunoaştere automată
5=Încearcă identificarea automată (nerecomandat)
6=Selectare
7=Tipul de date a fost identificat cu succes
8=Negăsit
9=Tipul de date nu a fost recunoscut
10=Text ( ANSI )
11=Text ( OEM )
12=Text ( UNICODE )
13=Imagine ( BMP )
14=Imagine ( JPG )
15=Imagine ( TIFF )
16=Meta-fişier
17=Bloc necunoscut
